#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/benoit/diag/runs/run-ehyqcU5iS5Vn5Dw7

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.kops: Refreshing state... [id=kops]
aws_iam_group.kops: Refreshing state... [id=kops]
aws_ecr_repository.diag: Refreshing state... [id=diag]
aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"]: Refreshing state... [id=kops-20220103140648631300000005]
aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=kops-20220103140648632400000007]
aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/IAMFullAccess"]: Refreshing state... [id=kops-20220103140648631400000006]
aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonS3FullAccess"]: Refreshing state... [id=kops-20220103140648633700000008]
aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonSQSFullAccess"]: Refreshing state... [id=kops-20220103140648626000000003]
aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"]: Refreshing state... [id=kops-20220103140648630300000004]
aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonVPCFullAccess"]: Refreshing state... [id=kops-20220103140648620700000002]
aws_iam_group_membership.kops: Refreshing state... [id=kops]
aws_s3_bucket.kops: Refreshing state... [id=bjbjb-org-com]
aws_iam_policy.ecr_access: Refreshing state... [id=arn:aws:iam::144149190966:policy/ecr_access]
aws_iam_group_policy_attachment.ecr_access: Refreshing state... [id=kops-20220103140648619000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.kops-info will be created
  + resource "aws_s3_bucket" "kops-info" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "bjbjb-org-com-info"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pusher: @bbourbie, Action: `pull_request`*